/*

1. Каким может быть позиционирование элемента в документе?

Статическое позиционирование

Относительное позиционирование

Абсолютное позиционирование

Фиксированное позиционирование

Все вышеперечисленное]

2. Какого(их) значения(ий) нет у свойства position?

absolute

static

sticky

normal]

advanced]

relative

fixed

none]

3. Какое из перечисленных свойств позволяет разрешить перенос flex-элементов на новую строку, если они не помещаются в контейнер?

flex-sorter

flex-order

flex-wrap]

flex-column

flex-direction

4. Какие элементы по умолчанию являются блочными?

<div>]

<i>

<span>

<p>]

<a>

<ul>]

<li>]

<img>

<table>]

5. Какое свойство помогает скрыть элемент со страницы, как будто его нет и не было?

display: block

display: inline

display: inline-block

display: list-item

display: none]

display: run-in

display: table

display: flex

6. Каким образом задать стили, чтобы элементы <div> располагались рядом друг с другом по горизонтали слева направо?

display: flex для родительского элемента]

float: left]

display: inline-block]

7. Как правильно добавить свойство flexbox выбранному набору элементов на странице?

Задать "display: flex" родительскому элементу выбранных элементов]

Задать "display: flex" каждому элементу, который мы хотим превратить в flex-элемент

Задать "display: flex" для всех элементов на странице

Задать "display: flex" html тегу

8. Какое значение свойства flex-direction необходимо указать, чтобы дочерние элементы расположились горизонтально слева направо?

column

column-reverse

row-reverse

row]

9. Выберите верное утверждение, относительно свойства align-content:

С помощью этого свойства можно менять порядок отображения флекс-элементов внутри флекс-контейнера

Свойство распределяет свободное пространство по поперечной оси между рядами флекс-элементов]

Это свойство указывает, может ли вырастать флекс-элемент при наличии свободного места, и насколько

При помощи этого свойства можно выровнять один или несколько элементов иначе, чем задано у родительского элемента

10. Какое значение по умолчанию у свойства align-self, применяемое к родительскому элементу для flex блоков?

flex-start

flex-end

center

stretch?

space-between

space-around

baseline

auto]

11. Какое значение по умолчанию у свойства align-items, применяемое к родительскому элементу для flex блоков?

flex-start

flex-end

center

stretch]

space-between

space-around

baseline

auto

! НЕ ПРАВИЛЬНО 12. Укажите пункты, правильно характеризующие строчные элементы:

До и после элемента не добавляются переносы строки]

Можно задавать ширину, высоту, внутренние и внешние отступы для элемента]

Ширина и высота элемента зависит только от его содержания, задать размеры с помощью CSS нельзя

К ним относится тег <textarea>]

Элементы занимают всю ширину своего родителя (контейнера)

13. Какое свойство отвечает за выравнивание элементов по главной оси?

justify-content]

align-content

flex-direction

align-items

align-self

flex: start

flex: stretch

14. Какие свойства содержит в себе свойство-сокращение flex-flow?

Такого свойства не существует

flex-wrap и flex-shrink

flex-direction и flex-grow

flex-direction и flex-wrap]

15. Родительский элемент, на который назначено свойство display: flex называется...

flex parent

flex container]

flex item

main axis

16. Какое из перечисленных свойств позволяет менять порядок следования flex-элементов?

flex-wrap

flex-sorter

flex-order

flex-column

order]

sorter

column

wrap

! НЕ ПРАВИЛЬНО 17. Какое(ие) значение(ия) position может иметь абсолютно позиционируемый элемент?

absolute]

static

sticky]

normal

advanced

relative

fixed]

none

18. flex - это сокращённое свойство, в которым можно задать 3 разные свойства:

flex-grow]

flex-shrink]

flex-direction

flex-basis]

flex-order

19. Каким способом можно отцентрировать по горизонтали блочный элемент?

Задать элементу ширину, которая больше ширины родительского контейнера и задать для внешних отступов справа и слева значение auto

Задать элементу ширину, которая меньше ширины родительского контейнера и задать для внешних отступов справа и слева значение auto]

Задать элементу ширину, которая меньше ширины родительского контейнера и задать для внешних отступов сверху и снизу значение auto

Задать элементу ширину, которая больше ширины родительского контейнера и задать для внешних отступов сверху и снизу значение auto

20. Какое значение по умолчанию у свойства flex?

1 0 auto

0 1 auto]

0 1 0

0 0 auto

0 0 0



! НЕправильно 21.Выберите правильные утверждения, относительно position: absolute

Элемент с данным позиционированием убирается из основного потока документа

Элемент с значением position: absolute не является позиционированным элементом

Элемент располагается относительно его ближайшего относительно позиционированного предка (если таковой имеется)]

Элемент позиционируется в нормальном потоке так же, как и статичный, а затем смещается при помощи свойств left, right, top, bottom относительно ближайшего родителя, имеющего прокрутку]
*/