
/*

1. В записи {padding: 10px 15px 20px 25px;} отступ сверху будет равен:

10px]

15px

20px

25px

2. Позволяет ли Каскадность комбинировать стили из разных источников?

да]

нет

3. В каком формате записываются стили в теге style?

в формате HTML

в формате JS

в формате JSON

в формате CSS]

4. Анимация задана с помощью @keyframes. Нам нужно задать продолжительность анимации (animation-duration) в полсекунды. Какие из вариантов сработают?

(1/2)s

calc(1/2)s

0.5s]

500ms]

0.0005ks

5. У элемента есть свойства {position: relative; top: 20px;}. Куда сдвинется элемент относительно текущей позиции на 20 пикселей?

вверх

вправо

вниз]

влево

6. Если родительскому элементу задан размер шрифта 24px, то это размер будет унаследован:

вложенными элементами только первого уровня

всеми вложенными элементами]

ни один вложенный элемент размер не унаследует

7. Среди четырех записанных стилей (одинаковое свойство) применится то, которое указано с помощью:

селектора по классу

атрибута style внутри тега]

селектора по id

селектора по тегу

8. У элемента есть набор свойств {padding: 10px 20px; margin: 30px; border: 5px solid #040;}. Каков будет полный (суммарный) отступ справа от контента?

45

50

55]

85

95

9. Для того, чтобы задать стиль прямо в элементе, т.е. записать стиль inline, используют атрибут:

style]

css

stylesheet

text

10. Так называется семейство шрифтов без засечек:

serif

sans-serif]

cursive

monospace

11. Таких вариантов насыщенности шрифта не предусмотрено в CSS:

0]

100

500

800

1200]

12. В браузере Google Chrome, тег h1 по умолчанию имеет размер:

32px (2em)]

24px (1.5em)

16px (1em)

8px (0.5em)

13. Степень прозрачности в записи rgba варьируется в пределах:

от 0 до 1]

от 0 до 10

от 0 до F

от 0 до 255

14. Выберите верные значения свойства color, задающие насыщенный красный цвет:

#FF0000]

#0000FF

rgb(0, 255, 0)

rgb(255, 0, 0)]

hsl(0, 100%, 50%)]

15. В записи {font: italic bold 24px Arial;}, Arial - это:

размер шрифта

стиль шрифта

семейство шрифтов]

насыщенность шрифта

16. Выберите верный селектор класса class-name в CSS:

#class-name

.class-name]

.class.name

class-name

17. Значение размера шрифта у родительского элемента 12px, а у дочернего элемента 4em. Какой размер шрифта в пикселях будет у дочернего элемента?

64px

48px]

36px

32px

24px

18. Высота блока div без текста определяется свойством:

width

line-height

high

height]

19. В браузере Google Chrome по умолчанию, родительский элемент имеет свойство {font-size: 2rem;}, а дочерний элемент {font-size: 200%;}. Каков будет размер шрифта у дочернего элемента в пикселях?

16px

24px

48px

64px]

72px

20. Если переменная записана как :root {--main-color: #000;}, то применить ее можно таким образом:

color: parse(--main-color);

color: var(--main-color);]

color: root(--main-color);

color: --main-color;

21. Согласно документации, где должен располагаться тег style? (Валидатор W3C не выдаст ошибку)

вне тега html

в теге html, но не в head или body

в теге head]

в теге body

22. Передав значение #aaa в некоторые из свойств, можно сделать фон серым. В какие?

background-image

background-color]

background-position

background-repeat

background]

23. В многострочном текстовом элементе, межстрочный интервал можно изменить с помощью свойства:

line-height]

height

padding

padding-bottom

24. При базовом использовании {position: absolute}, в какой край экрана попадет элемент?

верхний правый

нижний правый

нижний левый

верхний левый]

25. Это значение свойства border-style задаст границу элемента в виде точечек:

solid

double

dashed

dotted]

26. Какое значение свойства text-align сделает так, чтобы текст был выровнен по правому краю?

right]

center

left

justify

27. Сделать шрифт наклонным (как вариант, курсивным), можно с помощью этих значений свойства font-style:

none

italic]

oblique]

unset

normal

28. Для браузера Mozilla Firefox, вендорный префикс для стилей выглядит так:

-ms-

-webkit-

-moz-]

-ff-

29. Внешние отступы задаются свойством:

border

margin]

padding

box-sizing

30. Выберите значение свойства color, записанное в формате HEX, обозначающее насыщенный синий цвет:

#000000

#FF0000

#00FF00

#0000FF]

#FFFFFF

31. Сделать так, чтобы все слова в тексте начинались с большой (заглавной) буквы можно с помощью этого значения свойства text-transform:

none

uppercase

capitalize]

lowercase

32. Перечеркивание текста по центру можно сделать с помощью этого значения свойства text-decoration:

none

underline

overline

line-through]

33. Выберите верный селектор айди id-name в CSS:

.id-name

#id.name

#id-name]

=======
/*

1. В записи {padding: 10px 15px 20px 25px;} отступ сверху будет равен:

10px]

15px

20px

25px

2. Позволяет ли Каскадность комбинировать стили из разных источников?

да]

нет

3. В каком формате записываются стили в теге style?

в формате HTML

в формате JS

в формате JSON

в формате CSS]

4. Анимация задана с помощью @keyframes. Нам нужно задать продолжительность анимации (animation-duration) в полсекунды. Какие из вариантов сработают?

(1/2)s

calc(1/2)s

0.5s]

500ms]

0.0005ks

5. У элемента есть свойства {position: relative; top: 20px;}. Куда сдвинется элемент относительно текущей позиции на 20 пикселей?

вверх

вправо

вниз]

влево

6. Если родительскому элементу задан размер шрифта 24px, то это размер будет унаследован:

вложенными элементами только первого уровня

всеми вложенными элементами]

ни один вложенный элемент размер не унаследует

7. Среди четырех записанных стилей (одинаковое свойство) применится то, которое указано с помощью:

селектора по классу

атрибута style внутри тега]

селектора по id

селектора по тегу

8. У элемента есть набор свойств {padding: 10px 20px; margin: 30px; border: 5px solid #040;}. Каков будет полный (суммарный) отступ справа от контента?

45

50

55]

85

95

9. Для того, чтобы задать стиль прямо в элементе, т.е. записать стиль inline, используют атрибут:

style]

css

stylesheet

text

10. Так называется семейство шрифтов без засечек:

serif

sans-serif]

cursive

monospace

11. Таких вариантов насыщенности шрифта не предусмотрено в CSS:

0]

100

500

800

1200]

12. В браузере Google Chrome, тег h1 по умолчанию имеет размер:

32px (2em)]

24px (1.5em)

16px (1em)

8px (0.5em)

13. Степень прозрачности в записи rgba варьируется в пределах:

от 0 до 1]

от 0 до 10

от 0 до F

от 0 до 255

14. Выберите верные значения свойства color, задающие насыщенный красный цвет:

#FF0000]

#0000FF

rgb(0, 255, 0)

rgb(255, 0, 0)]

hsl(0, 100%, 50%)]

15. В записи {font: italic bold 24px Arial;}, Arial - это:

размер шрифта

стиль шрифта

семейство шрифтов]

насыщенность шрифта

16. Выберите верный селектор класса class-name в CSS:

#class-name

.class-name]

.class.name

class-name

17. Значение размера шрифта у родительского элемента 12px, а у дочернего элемента 4em. Какой размер шрифта в пикселях будет у дочернего элемента?

64px

48px]

36px

32px

24px

18. Высота блока div без текста определяется свойством:

width

line-height

high

height]

19. В браузере Google Chrome по умолчанию, родительский элемент имеет свойство {font-size: 2rem;}, а дочерний элемент {font-size: 200%;}. Каков будет размер шрифта у дочернего элемента в пикселях?

16px

24px

48px

64px]

72px

20. Если переменная записана как :root {--main-color: #000;}, то применить ее можно таким образом:

color: parse(--main-color);

color: var(--main-color);]

color: root(--main-color);

color: --main-color;

21. Согласно документации, где должен располагаться тег style? (Валидатор W3C не выдаст ошибку)

вне тега html

в теге html, но не в head или body

в теге head]

в теге body

22. Передав значение #aaa в некоторые из свойств, можно сделать фон серым. В какие?

background-image

background-color]

background-position

background-repeat

background]

23. В многострочном текстовом элементе, межстрочный интервал можно изменить с помощью свойства:

line-height]

height

padding

padding-bottom

24. При базовом использовании {position: absolute}, в какой край экрана попадет элемент?

верхний правый

нижний правый

нижний левый

верхний левый]

25. Это значение свойства border-style задаст границу элемента в виде точечек:

solid

double

dashed

dotted]

26. Какое значение свойства text-align сделает так, чтобы текст был выровнен по правому краю?

right]

center

left

justify

27. Сделать шрифт наклонным (как вариант, курсивным), можно с помощью этих значений свойства font-style:

none

italic]

oblique]

unset

normal

28. Для браузера Mozilla Firefox, вендорный префикс для стилей выглядит так:

-ms-

-webkit-

-moz-]

-ff-

29. Внешние отступы задаются свойством:

border

margin]

padding

box-sizing

30. Выберите значение свойства color, записанное в формате HEX, обозначающее насыщенный синий цвет:

#000000

#FF0000

#00FF00

#0000FF]

#FFFFFF

31. Сделать так, чтобы все слова в тексте начинались с большой (заглавной) буквы можно с помощью этого значения свойства text-transform:

none

uppercase

capitalize]

lowercase

32. Перечеркивание текста по центру можно сделать с помощью этого значения свойства text-decoration:

none

underline

overline

line-through]

33. Выберите верный селектор айди id-name в CSS:

.id-name

#id.name

#id-name]

id-name

*/