/*

1. Стоит ли обращать внимание на протокол, который используется на сайте, при заполнении формы с личными данными и паролями?

Нет, протокол не имеет особого значения

Да, должен быть протокол HTTP

Да, должен быть протокол HTTPS]

2. Выберите верное утверждение:

Нельзя ограничить максимально допустимое количество символов для текстовых полей <input>

Поле у <textarea> будет невалидным, если количество символов его содержимого будет больше minlength или меньше maxlength

<textarea> не поддерживает атрибут pattern]

У <input> c атрибутом type='number' можно ограничить диапазон допустимых значений только с помощью JS

Нет правильного утверждения

3. Выберите справедливые утверждения для тега <fieldset>:

тег одиночный

применяется только внутри тега <form>]

по умолчанию имеет свойство display: block]

внутри <fieldset> может применяться тег <legend>]

4. Выберите верное утверждение, касающееся атрибута novalidate тега <form>:

Такого атрибута не существует

Отключает автоматическую валидацию браузером и поддержку Constraint Validation API

Отключает автоматическую валидацию браузером и включает поддержку Constraint Validation API

Отключает встроенные сообщения об ошибках и позволяет вместо этого добавлять кастомные сообщения из JS]

5. Какие значения для атрибута method тега <form> валидные?

get]

post]

put

pull

delete
6. Какие протоколы передачи данных используются в HTML-формах?

TCP/IP

UDP

FTP

DNS

HTTP]

HTTPS]

NTP

SSH

7. Выберите верное утверждение:

<button> принимает атрибут type, которому можно присвоить значения submit, reset или button]


У <form> есть вложенный <button> с атрибутом type='button'. При таком условии клик по кнопке отправляет данные из формы на страницу, определённую в атрибуте action элемента <form>

<form> можно стилизовать только с помощью тега <style>

<form> определяет куда и каким способом отправить данные благодаря атрибутам enctype и target.

