/*

1. Стоит ли обращать внимание на протокол, который используется на сайте, при заполнении формы с личными данными и паролями?

Нет, протокол не имеет особого значения

Да, должен быть протокол HTTP

Да, должен быть протокол HTTPS]

2. Выберите верное утверждение:

Нельзя ограничить максимально допустимое количество символов для текстовых полей <input>

Поле у <textarea> будет невалидным, если количество символов его содержимого будет больше minlength или меньше maxlength

<textarea> не поддерживает атрибут pattern]

У <input> c атрибутом type='number' можно ограничить диапазон допустимых значений только с помощью JS

Нет правильного утверждения

!Не верно 3. Выберите справедливые утверждения для тега <fieldset>:

тег одиночный

применяется только внутри тега <form>]

по умолчанию имеет свойство display: block]

внутри <fieldset> может применяться тег <legend>]

4. Выберите верное утверждение, касающееся атрибута novalidate тега <form>:

Такого атрибута не существует

Отключает автоматическую валидацию браузером и поддержку Constraint Validation API

Отключает автоматическую валидацию браузером и включает поддержку Constraint Validation API

Отключает встроенные сообщения об ошибках и позволяет вместо этого добавлять кастомные сообщения из JS]

5. Какие значения для атрибута method тега <form> валидные?

get]

post]

put

pull

delete
6. Какие протоколы передачи данных используются в HTML-формах?

TCP/IP

UDP

FTP

DNS

HTTP]

HTTPS]

NTP

SSH

7. Выберите верное утверждение:

<button> принимает атрибут type, которому можно присвоить значения submit, reset или button]


У <form> есть вложенный <button> с атрибутом type='button'. При таком условии клик по кнопке отправляет данные из формы на страницу, определённую в атрибуте action элемента <form>

<form> можно стилизовать только с помощью тега <style>

<form> определяет куда и каким способом отправить данные благодаря атрибутам enctype и target.

8. Выберите варианты ответа, которые неверно характеризуют метод GET HTML-формы

метод GET отправляет запрос с сервера в браузер]

при использовании метода GET данные отправляются в теле запроса]

метод GET отправляет запрос на сервер, используя для этого специальный GET-протокол]

метод GET запрашивает у сервера ресурс, данные формы добавляются в адрес запроса

9. Выберите утверждения, справедливые для <input> с атрибутом type, равным password:

Однострочное текстовое поле, в котором каждый символ заменен другим символом, чаще всего звездочкой или точкой]

Если указан атрибут pattern, содержимое считается действительным только если значение проходит проверку]

С таким полем использовать <label> нельзя

Чтобы менеджер паролей автоматически вводил пароль, необходимо добавить атрибут autocomplete]

Для такого <input> атрибут disabled не работает

10. Можно ли в браузере посмотреть HTTP-запрос, отправленный с помощью формы?

HTTP-запросы никогда не отображаются, посмотреть их нельзя

Можно из какого-либо IDE (ex. Vs Code, WebStorm...)

Можно в браузерах в девтулах (ex. Chrome Dev Tools)]

Можно посмотреть только GET-запрос в браузерах в девтулах (ex. Chrome Dev Tools)

11. Как отреагирует браузер если сайт использует протокол HTTPS, а в HTML-форме указан адрес с протоколо HTTP?

Веб-страница не загрузится, т.к. это невалидная веб-страница

Веб-страница загрузится и при отправке формы будет выдано предупреждение о проблемах с безопасностью]

Веб-страница загрузится и всё будет работать как обычно

12. Выберите верное утверждение, касающееся атрибута customValidate тега <form>:

Такого атрибута не существует]

Отключает автоматическую валидацию браузером и поддержку Constraint Validation API

Отключает автоматическую валидацию браузером и включает поддержку Constraint Validation API

Отключает встроенные сообщения об ошибках и позволяет вместо этого добавлять кастомные сообщения из JS

13. Элемент <input> имеет атрибут type со значением email. Какой еще атрибут обязательно нужно добавить для того, чтобы поле валидировалось в соответствии шаблона email-адресов?

атрибут pattern

атрибут multiple

атрибут required

не нужно добавлять дополнительный атрибут]

14. Выберите пункты, относящиеся к встроенной валидации форм HTML5:

атрибут required у <input>]

атрибут pattern, используемый с регулярным выражением]

атрибуты minlength и maxlength у <textarea>]

атрибут type, определяющий тип данных в поле]

15. Выберите атрибуты тега <input>:

type]

checked]

disabled]

for

target

16. Какое значение атрибута type тегов <input> должен быть установлен, если необходимо создать кнопки-переключатели для выбора только одного значения из нескольких?

checkbox

file

hidden

image

password

radio]

reset

text

17. Выберите варианты ответа, которые верно характеризуют метод POST HTML-формы

при использовании метода POST данные отправляются в теле запроса]

в отличии от метода GET в запрос добавляются дополнительные заголовки, такие как Content-Length и Content-Type]

запрос методом POST нельзя посмотреть в браузере

запрос методом POST можно посмотреть только в стороннем ПО
18. Какого тега нет среди табличных?

"td"

"tf"]

"th"

"tr"

19. Выберите атрибуты тега <form>:

enctype]

method]

for

target]

type

action]

name]

stylesForm

20. Отметьте утверждение, справедливое для псевдокласса :valid

Работает с <table>

Позволяет показать сообщение пользователю, если поле невалидно

Уже не поддерживается современными браузерами

Применяется к тегам <form> и <input>]

*/

