/*

1. Стоит ли обращать внимание на протокол, который используется на сайте, при заполнении формы с личными данными и паролями?

Нет, протокол не имеет особого значения

Да, должен быть протокол HTTP

Да, должен быть протокол HTTPS]

2. Выберите верное утверждение:

Нельзя ограничить максимально допустимое количество символов для текстовых полей <input>

Поле у <textarea> будет невалидным, если количество символов его содержимого будет больше minlength или меньше maxlength

<textarea> не поддерживает атрибут pattern]

У <input> c атрибутом type='number' можно ограничить диапазон допустимых значений только с помощью JS

Нет правильного утверждения

3. Выберите справедливые утверждения для тега <fieldset>:

тег одиночный

применяется только внутри тега <form>]

по умолчанию имеет свойство display: block]

внутри <fieldset> может применяться тег <legend>]

4. Выберите верное утверждение, касающееся атрибута novalidate тега <form>:

Такого атрибута не существует

Отключает автоматическую валидацию браузером и поддержку Constraint Validation API

Отключает автоматическую валидацию браузером и включает поддержку Constraint Validation API

Отключает встроенные сообщения об ошибках и позволяет вместо этого добавлять кастомные сообщения из JS]



*/

