/*


1. Чтобы узнать текстовые параметры элемента необходимо выделить элемент и открыть вкладку Inspect в правой боковой панели. Найти параметры в появившемся списке свойств.

верно]

неверно

2. В какие форматы можно экспортировать (скопировать) объект, созданный в фигме?

CSS]

BMP

GIF]

PSD

SVG]

ECW

PNG]

ICO

3. Чтобы показать линейки и вытянуть направляющие в Фигме, необходимо:

Во вкладке View выбрать пункт Mask Outlines

Во вкладке View выбрать пункт Show slices

Во вкладке View выбрать пункт Frame Outlines

Во вкладке View выбрать пункт Rulers]

4. В фигме нельзя узнать название шрифта.

верно

неверно]

можно узнать только в случае, если шрифт относится к Google Fonts

5. В фигме нельзя установить дополнительные плагины

верно

неверно]

6. Чтобы узнать фоновый цвет элемента необходимо выделить элемент и открыть вкладку Inspect в правой боковой панели. Параметр фонового цвета будет находиться в свойстве color

верно

неверно]


7. Выберите верные возможности фигмы:

бесплатная (есть платная версия)]

Многопользовательский режим редактирования]

Комментирование макетов]

хранение файлов в облаке Google Cloud по умолчанию

8. Что находится во вкладке Recent?

Сохраненные проекты

Популярные проекты среди пользователей

Последние просмотренные проекты]

Нет верного ответа

9. Какие характеристики шрифта можно найти на боковой панели при клике на текст?

Text align

Letter spacing]

Прозрачность]

Цвет]

Начертание]

Название шрифта]

Paragraph spacing

10. Доступны ли в Фигме какие-либо шрифты по умолчанию?

не доступны

доступны шрифты Microsoft Words

доступны шрифты Google Fonts]

доступен только шрифт Arial

11. Где можно включить/отключить пиксельную сетку для заднего фона?

Main menu > View > Layout Grids

Main menu > View > Pixel Grid]

Main menu > View > Show slices

Main menu > View > Frame Outlines

12. Как сохранить проект в свой аккаунт, после перехода по ссылке на проект?

На верхней панели нажать на стрелку и далее на клавишу Export...

На верхней панели нажать на стрелку и далее на клавишу Duplicate to your Drafts]

Выйти из проекта > вкладка Recent > нажать правой клавишей на последний проект > Duplicate]

Выйти из проекта > вкладка Recent > нажать правой клавишей на последний проект > Share

Выйти из проекта > вкладка Recent > нажать правой клавишей на последний проект > Open in new tab

На верхней панели нажать на Share]

13. В какой формат можно сохранять картинку из макета?

BMP

JPG]

GIF

PSD

SVG]

ECW

PNG]

ICO

PDF]

14. Что такое фрейм в Figma?

законченный документ, например страница сайта или экран приложения]

это отдельный объект, текст или фотография

это слой или группа

это модульная сетка

в Figma нет понятия "фрейм"

15. Для чего предназначена функция Pixel Preview?

для масштабирования макета

для масштабирования элемента

просмотр макета в пикселях, вместо векторов]

показать линейки и вытянуть направляющие

для того чтобы расширить рабочую область


