/*


1. Чтобы узнать текстовые параметры элемента необходимо выделить элемент и открыть вкладку Inspect в правой боковой панели. Найти параметры в появившемся списке свойств.

верно]

неверно

2. В какие форматы можно экспортировать (скопировать) объект, созданный в фигме?

CSS]

BMP

GIF]

PSD

SVG]

ECW

PNG]

ICO

3. Чтобы показать линейки и вытянуть направляющие в Фигме, необходимо:

Во вкладке View выбрать пункт Mask Outlines

Во вкладке View выбрать пункт Show slices

Во вкладке View выбрать пункт Frame Outlines

Во вкладке View выбрать пункт Rulers]

4. В фигме нельзя узнать название шрифта.

верно

неверно]

можно узнать только в случае, если шрифт относится к Google Fonts

5. В фигме нельзя установить дополнительные плагины

верно

неверно]

6. Чтобы узнать фоновый цвет элемента необходимо выделить элемент и открыть вкладку Inspect в правой боковой панели. Параметр фонового цвета будет находиться в свойстве color

верно

неверно]


7. Выберите верные возможности фигмы:

бесплатная (есть платная версия)]

Многопользовательский режим редактирования]

Комментирование макетов]

хранение файлов в облаке Google Cloud по умолчанию

8. Что находится во вкладке Recent?

Сохраненные проекты

Популярные проекты среди пользователей

Последние просмотренные проекты]

Нет верного ответа

9. Какие характеристики шрифта можно найти на боковой панели при клике на текст?

Text align

Letter spacing]

Прозрачность]

Цвет]

Начертание]

Название шрифта]

Paragraph spacing


