/*


1. Какая структура данных позволяет обрабатывать элементы в порядке их добавления в эту структуру (т.е. поддерживает принцип FIFO - First In First Out)?

Stack (стек)

Queue (очередь)

Tree (дерево)

Linked List (связный список)

2. На какой внутренней (стандартной) JS структуре удобнее и быстрее всего можно создать Stack?

Set

Map / Tree / Object

Array

Linked List
3. К каким элементам есть доступ в традиционной реализации структуры данных Stack?

Только к верхушке стека (последний добавленный элемент)

Только к основанию стека (первый добавленный элемент)

Только ко второму элементу после верхушки

Доступ есть к любому элементу стека
4. Структура данных, у которой самый быстрый доступ к элементам по ключу, где ключ является числовым, начинается от 0 и не имеет пропущенных значений в середине:

Set

Map / Object

Array

Linked List
5. Какой метод Array проверяет, что все элементы удовлетворяют некоторому условию (предикату)?

.forEach()

.check()

.every()

.some()

.filter()
6. Какая структура данных хранит внутри себя лишь уникальные элементы?

Set

Map / Object

Array

Linked List
7. В каком варианте использования структуры Linked List и Array показывают схожую скорость выполнения операции?

Добавление элемента в конец списка / массива

Доступ к произвольному элементу по индексу

Модификация произвольного элемента по индексу

Вывод всех элементов списка / массива в консоль

Удаление элемента из списка / массива
8. В какой структуре данных удобнее всего работать со вложенными свойствами / параметрами?

Set

Map / Tree / Object

Array

Linked List

9. Структура данных, которая обеспечивает быстрый доступ по ключу, который не обязательно является числовым либо может иметь пропущенные значения в числовом порядке (например, “0”, “4”, “5”, “100”):

Set

Map / Object

Array

Linked List
10. В каких вариантах использования структуры Linked List и Array показывают сильно различную скорость выполнения операции?

Доступ к произвольному элементу по индексу

Модификация произвольного элемента по индексу

Вывод всех элементов списка / массива в консоль

Удаление элемента из списка / массива


*/