/*

1. Какими способами могут быть добавлены медиазапросы внутри css-файла?

внутри css-файла с помощью правила @media]

внутри css-файла с помощью правила @import]

внутри css-файла с помощью правила @query

2. Что из перечисленного может использоваться при создании адаптивного веб-дизайна?

media queries]

flexbox]

css grid]

гибкие изображения (с использованием min-width, max-width)]

3. Какие логические операторы работают в строке медиазапроса?

and]

as

&&

only]

not]

4. Выберите верное утверждение:

Отзывчивый и адаптивный дизайн это одно и то же понятие

Отзывчивый и респонсив дизайн это одно и то же понятие]

Отзывчивый, адаптивный и респонсив дизайн это одно и то же понятие

5. Поток - это поведение, при котором содержимое страницы начинает занимать больше высоты, и элементы начинают смещаться вниз(при уменьшении размера экрана).

верно]

неверно

6. Выберите правильный ответ:

Mobile first - это подход, используемый для верстки исключительно под мобильные устройства

Существует подход Desktop first, при котором верстка ведется для компьютеров в первую очередь]

Оба ответа верны

7. Скобки в медиазапросах применяются для изменения приоритета операций.

верно

применяются, но не для изменения приоритета операций

применяются для изменения приоритета операций, а также для указания типов целевых устройств]

8. Выберите верное утверждение:

Для responsive дизайна для элементов лучше использовать свойство width, чем max-width и min-width

Такая запись подключения медиазапроса в .css будет верной: <link rel=\"stylesheet\" media=\"screen and (max-width: 543px)\" href=\"styles-xs.css\">

Директива @media в .sass работает также, как и в .css, только с некоторыми дополнительными возможностями]

нет правильного ответа

9. Внутри каких медиазапросов будут поддерживаться свойcтва на экране 768px?

@media (min-width: 640px) {...}]

@media (max-width: 980px) {...}]

@media (max-width: 640px) {...}

@media (min-width: 980px) {...}

10. Для чего используется метатег viewport?

Для подключения медиазапроса в js

Для того чтобы определить медиазапрос для таблицы

Для того, чтобы контролировать размер окна просмотра и масштаб]

Для того, чтобы медиазапрос корректно отрабатывал в IE7

11. Есть ли различие в понятиях adaptive design и responsive design?

различий нет

adaptive используется для мобильной верстки, а responsive для верстки под браузеры на компьютерах

responsive - резиновый макет, при уменьшении ширины такой страницы контент плавно сожмется, а adaptive это дизайн, который отрисовывается для юзера, исходя из используемого устройства]

adaptive - резиновый макет, при уменьшении ширины такой страницы контент плавно сожмется, а responsive - дизайн, который отрисовывается для юзера, исходя из используемого устройства

12. Выберите верное утверждение:

@media запросы в .sass не могут вкладываться друг в друга.

@media запросы в .sass могут содержать в себе переменные]

оба утверждения неверны

13. Выберите атрибуты viewport:

user-scalable]

initial-width

height]

maximum-scale]

14. Выберите относительные единицы измерения в css:

%]

pt

rem]

cm

em]

pc

vh]

15. Какими способами могут быть добавлены медиазапросы внутри html-файла?

с помощью тега link]

с помощью тега style и правила @import]

с помощью тега style и правила @media]

c помощью тега style и правила @query

16. В спецификации CSS есть задокументированные контрольные точки для верстки адаптивного и респонсив дизайнов, по ним необходимо разделять верстку макета для мобильного телефона, планшета и десктопа.

верно]

неверно

17. 1rem равен значению font-size, которое было определено в html.

верно]

неверно

18. Оператор ,(запятая) используется для объединения нескольких условий в медиазапросе. В этом случае результат будет истинным, если каждое из условий будет истинным.

верно]

неверно

19. Выберите верное утверждение:

Для адаптивного дизайна(согласно спецификации CSS) необходимо создать минимум 3 макета(для мобильных устройств, планшета и компьютера)]

Для респонсив дизайна(согласно спецификации CSS) необходимо создать минимум 3 макета(для мобильных устройств, планшета и компьютера)

оба утверждения верны

оба утверждения неверны

20. Чувствительны ли к регистру медиазапросы?

да

нет]

21. Что такое Viewport?

метатег, применяемый к страницам для браузеров, не поддерживающим медиазапросы

логический оператор для медиазапросов

видимая область веб-страницы, если не прибегать к прокрутке]

область веб-страницы, вместе с прокруткой страницы

22. Выберите правильные варианты значений параметра orientation для медиазапроса:

portrait]

vertical

horizontal

landscape]

23. Какие единицы измерения лучше использовать для адаптивной верстки?

относительные]

абсолютные

24. Выберите типы медиазапросов:

all]

screen]

mobile

speech]

print]

25. Тегу <html> не назначен размер шрифта. Шрифт <body> имеет размер в 1rem, вложенный в него <div> имеет размер шрифта 0.8rem, вложенный в него <p> - 0.5rem. Отметьте справедливые утверждения:

Значение шрифта у <body> будет 16px]

Значение шрифта у <div> будет 16px]

Значение шрифта у <div> будет 8px

Значение шрифта у <p> будет 6.4px]

Значение шрифта у <p> будет 8px]

*/
