1. Оператор & это...

ссылка на родителя]

логическое И

ссылка на значение переменной в памяти

Нет правильного ответа

2. Какие операторы (из перечисленных) существуют для работы со списками?

map

nth]

append]

join]

merge]

as]

3. Как правильно объявляется переменная со значением по умолчанию?

$width: 5em default;

$width: 5em;

$width: 5em !default;]

$width: 5em !=default;

4. Выберите преимущества SASS:

Полная совместимость с CSS]

Богатая функциональность]

Поддержка индустрией]

Большое сообщество]

BEM

5. Как правильно объявляется переменная?

$width: 5em;]

width: 5em;

$width = 5em;

6. Как правильно вызываются шаблонные селекторы?

@include title;

@import title;

@extend title;

@extend %title;]

@import %title;

@include %title;

7. Можно ли в комментариях использовать интерполяции переменных?

Да]

Нет

8. Можно ли так смешивать цвета color: mix(red, blue)?

Да]

Нет

9. Выберите истинное утверждение:

В режиме сжатия, Sass будет выводить то, что написано в sass

В режиме сжатия, Sass будет выводить наименьшее CSS представление цвета.]

Нет правильного ответа

10. SassScript поддерживает операторы И, ИЛИ и НЕ в следующем виде:

and, or, not]

&&, ||, !

такие операторы не поддерживаются

Нет правильного ответа

11. Какой командой можно в консоли запустить SASS в интерактивном режиме?

npm run sass -i

sass -i

sass -interactive]

12. Валиден ли следующий код: .funky { font: 20px/24px fantasy {weight: bold;}}?

Нет]

Да

13. Укажите валидные правила и директивы:

@import]

@media]

@extend]

@at-root]

@debug]

@try]

@catch]

@warning]

@warn]

@error]

14. Что получится в результате этой операции content: "Foo " + Bar;?

content: "Foo Bar";]

content: Foo Bar;

Нет правильного ответа

15. Какая запись шаблонных селекторов правильна?

.title{color:red}

#title{color:red}

%title{color:red}]

@title{color:red}

16. Выберите правильные варианты написания вложенных правил:

.article{ .title{ color: red; }}]

.article{ &.title{ color: red; }}]

.article{ &&.title{ color: red; }}

17. Выберите правильное утверждение:

CSS файл можно переименовать в SCSS и он будет валидным

CSS файл можно переименовать в SASS и он будет валидным

Все утверждения неверны]

18. Как в SassScript выглядит валидный синтаксис интерполяции?

@{$var}

#{$var}]

${$var}

Нет правильного ответа

19. Как правильно объявить локальную переменную, чтобы она стала доступна глобально?

$width: 5em global;

$width: 5em !global;]

$width: 5em !glob;

20. Выберите истинные утверждения:

Все типы данных поддерживают операции равенства ( == и != )

SassScript позволяет производить математические операции с разными типами (1px + 2rem + 3em + 4vh)]

Операторы сравнения ( <, >, <=, >=, ==, != ) также поддерживаются для чисел.]

SassScript поддерживает стандартные арифметические операции над числами (+, -, *, /, %).]

10px * 3px это валидная операция.