/*
1. Согласно валидатору W3C, какие атрибуты обязательно должны быть у элемента img, чтобы не было ошибки?

width

alt``

height

src``

align
2. С помощью какого атрибута указывается тип подключаемого файла в теге link?

rel``

href

src

source

3. Нумерованный список задается элементом:

ul

ol``

dl

4. По умолчанию, если нет сброса и обнуления стилей, элемент p (параграф) имеет отступы:

сверху``

справа

снизу``

слева

5. Для боковой панели существует специальный семантический элемент. Какой?

section

sidebar

main

aside``

6. Этот атрибут нужно задать элементу video, чтобы появилась панель управления видеоплеера:

control

controls``

panel

buttons

7. Эти теги изменят начертание текста (сделают его жирным или курсивным) без дополнительных стилей CSS:

i``

t

h

b``

p

8. Как задать высоту в 10 строк в элементе textarea?

rows=10``

height=10rows

cols=10

height=10

9. Параграфы обозначаются с помощью элемента

p``

paragraph

para

text

10. Правильной вложенностью будет считаться:

ul > a > li

li > ul > a

ul > li > a``

a > li > ul

11. В элементе img значение ширины width=32, соотвествует:

32% от ширины родителя

32% от ширины экрана

32pt

32px``

12. К семантическим тегам относят:

article``

nav``

div

footer``

span

main``

13. Этот мета-тег используется для описания страницы (поле name элемента meta):

content

about

author

description``

14. Этих типов элемента input не существует:

text

button

submit

radiobutton``

check``

15. Этих заголовков не существует:

h0``

h1

h2

h4

h8``

16. Текст в элементе img, который выведется вместо изображения, если оно недоступно, записывается в атрибут:

src

title

alt``

alternative

17. Какой атрибут указывает путь к файлу или странице, где располагается обработчик данных формы?

src

href

action``

route

18. Если поместить на страницу несколько элементов списка <li> без внешего контейнера (без ul, ol или dl), то они будут отображаться как:

элементы нумерованного списка

элементы маркированного списка

элементы списка определений

никак отличаться от базового текста не будут``

19. Укажите верную вложенность с элементом nav:

nav > li > a

ul > nav > a

nav > ul > li > a``

ul > nav > li > a

20. В табличной ячейке атрибут colspan объеденит указанное количество ячеек:

сверху

справа``

снизу

слева

21. Как указывается ссылка-якорь anchor в атрибуте href?

#anchor``

.anchor

name:anchor

:anchor

22. Чтобы связать label и input используют атрибуты:

for + name

id + id

name + id

for + id``

23. С помощью какого мета-тега можно запретить пользователю масштабировать страницу (поле name элемента meta):

description

viewport``

keywords

robots

24. Какова правильная запись неразрывного пробела через спецсимвол?

&amp;

&sp;

&space;

&nbsp;``

25. Эти элементы есть среди табличных:

table``

thead``

tbody``

tr``

th``

td``

26. В маркированном списке ul, без дополнительных стилей, точка рядом с элементом списка появляется благодаря использованию:

элемента li``

элемента ul

абсолютно любого элемента первого уровня внутри ul

27. Чтобы сделать множественный выбор в структуре select + option, нужно элементу select задать атрибут:

multi

multiple``

many

some

28. Атрибут lang=ru располагается в элементе:

doctype

body

html``

head


29. Какие из элементов блочные?

a

div``

img

span

p``

h1``

30. Внутри этого элемента пробелы сохраняются в любом количестве:

p

pre``

code

span