'use strict';

//========================================================================================================================================================

// Условия


//if ( 4 == 9) {
//	console.log('Ok!');
//} else {
//	console.log('Error');
//}

//const num = 50;

//if (num < 49) {
//	console.log('Error');
//} else if (num > 100) {
//	console.log('Много');
//} else {
//	console.log('Ok!');
//}


// Тернапный оператор

//(num == 50) ? console.log('Ok!') : console.log('Error');



// Конструкция Switch ( идет только строгое сравнение)

//  switch (num) {
//  	case 49:
//  		console.log('Неверно');
//  		break;
//  	case 100:
//  		console.log('Неверно');
//  		break;
//  	case 50:
//  		console.log('В точку');
//  		break;
//  	default:
//  		console.log('Error');
//  		break;
//  }


//========================================================================================================================================================

// Циклы

//let num = 50;
//
// первый цикл while

//while (num <= 55) {
//	console.log(num);
//	num++;
//};


// второй цикл do... while

//do {
//	console.log(num);
//	num++;
//}
//while (num <= 55);

// третий цикл for


//for (let i = 1; i <= 10; i++) {
//	if (i === 3) {
//		//break; // при заданом условие останавливает цикл
//		continue;  // при заданном условие пропускает это условие и идет дальше по циклу
//	}
//console.log(i);  // цикл отработал одну итерацию
//}

//========================================================================================================================================================


// Функции

function showMessage() {
	console.log('Hello World');
}

showMessage();

